In [2]:
import pandas as pd

In [3]:
d1 = ({"name":["wajid","mujahid","salman"], "age":[23, 23, 42], "address":["Multan", "Lahore","Vehari"]})
d2 = ({"work":["plumber","mechanic","carpenter"],"hobby":["plumbring","exploring","reading"]})

In [4]:
df1 = pd.DataFrame(data=d1)
df2 = pd.DataFrame(data=d2)

In [6]:
df1

      name  age address
0    wajid   23  Multan
1  mujahid   23  Lahore
2   salman   42  Vehari

In [7]:
df2

        work      hobby
0    plumber  plumbring
1   mechanic  exploring
2  carpenter    reading

In [8]:
df3 = pd.concat([df1,df2],axis=1,join='outer')

In [9]:
df3

      name  age address       work      hobby
0    wajid   23  Multan    plumber  plumbring
1  mujahid   23  Lahore   mechanic  exploring
2   salman   42  Vehari  carpenter    reading

In [11]:
d3 = ({"name":["wajid","mujahid","salman"], "age":[23, 23, 42], "address":["Multan", "Lahore","Vehari"]})
d4 = ({"work":["plumber","mechanic"],"hobby":["plumbring","exploring"]})

In [12]:
df3 = pd.DataFrame(d3)
df4 = pd.DataFrame(d4)

In [16]:
df5 = pd.concat([df3,df4],axis=1,join='outer')
df5

      name  age address      work      hobby
0    wajid   23  Multan   plumber  plumbring
1  mujahid   23  Lahore  mechanic  exploring
2   salman   42  Vehari       NaN        NaN

In [19]:
df5 = pd.concat([df3,df4],axis=1,join='inner') 
df5

      name  age address      work      hobby
0    wajid   23  Multan   plumber  plumbring
1  mujahid   23  Lahore  mechanic  exploring

### Joins/Merging

In [35]:
d3 = ({"name":["wajid","mujahid","salman"], "age":[23, 23, 42], "address":["Multan", "Lahore","Vehari"]})
d4 = ({"work":["plumber","mechanic"],  "age":[23, 23], "hobby":["plumbring","exploring"]})

In [36]:
df5 = pd.DataFrame(d3)
df6 = pd.DataFrame(d4)

In [37]:
pd.merge(df5, df6, how='outer')

      name  age address      work      hobby
0    wajid   23  Multan   plumber  plumbring
1    wajid   23  Multan  mechanic  exploring
2  mujahid   23  Lahore   plumber  plumbring
3  mujahid   23  Lahore  mechanic  exploring
4   salman   42  Vehari       NaN        NaN

In [38]:
pd.merge(df5, df6, how='inner')

      name  age address      work      hobby
0    wajid   23  Multan   plumber  plumbring
1    wajid   23  Multan  mechanic  exploring
2  mujahid   23  Lahore   plumber  plumbring
3  mujahid   23  Lahore  mechanic  exploring